benchmark_output_logs/mongodb_YCSB_workload_c_20211210_061902.out
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /home/azureuser/YCSB/mongodb/conf:/home/azureuser/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/azureuser/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/azureuser/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/home/azureuser/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/azureuser/.m2/repository/org/mongodb/mongo-java-driver/3.11.0/mongo-java-driver-3.11.0.jar:/home/azureuser/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/azureuser/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/azureuser/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureuser/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p mongodb.upsert=true -p recordcount=100000 -threads 24 -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p mongodb.upsert=true -p recordcount=100000 -threads 24 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2021-12-10 06:19:20:123 0 sec: 0 operations; est completion in 0 second 
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[localhost:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1, serverValue:134}] to localhost:27017
Dec 10, 2021 6:19:20 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=localhost:27017, type=REPLICA_SET_PRIMARY, state=CONNECTED, ok=true, version=ServerVersion{versionList=[5, 0, 5]}, minWireVersion=0, maxWireVersion=13, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=9791368, setName='rs0', canonicalAddress=10.1.0.5:27017, hosts=[10.1.0.5:27017, 10.1.0.6:27017, 10.1.0.7:27017], passives=[], arbiters=[], primary='10.1.0.5:27017', tagSet=TagSet{[]}, electionId=7fffffff0000000000000006, setVersion=1, lastWriteDate=Fri Dec 10 06:19:17 UTC 2021, lastUpdateTimeNanos=82216755679441}
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:12, serverValue:144}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:14, serverValue:146}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:21, serverValue:155}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:11, serverValue:143}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:13, serverValue:145}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:10, serverValue:142}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:23, serverValue:156}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:7, serverValue:139}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:5, serverValue:154}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:9, serverValue:141}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:22, serverValue:153}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:20, serverValue:152}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:18, serverValue:150}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:6, serverValue:138}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:8, serverValue:140}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:16, serverValue:148}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:19, serverValue:151}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:17, serverValue:149}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:15, serverValue:147}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:4, serverValue:137}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:3, serverValue:136}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:24, serverValue:157}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2, serverValue:135}] to localhost:27017
Dec 10, 2021 6:19:21 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:25, serverValue:158}] to localhost:27017
2021-12-10 06:19:30:009 10 sec: 7458 operations; 745.8 current ops/sec; est completion in 2 minutes [INSERT: Count=7458, Max=380415, Min=610, Avg=28781.68, 90=64831, 99=115775, 99.9=364799, 99.99=366335] 
2021-12-10 06:19:40:009 20 sec: 19501 operations; 1204.3 current ops/sec; est completion in 1 minute [INSERT: Count=12043, Max=340479, Min=509, Avg=19828.63, 90=29775, 99=69631, 99.9=248831, 99.99=312063] 
2021-12-10 06:19:50:009 30 sec: 34041 operations; 1454 current ops/sec; est completion in 59 seconds [INSERT: Count=14540, Max=253695, Min=480, Avg=16473.31, 90=23103, 99=45247, 99.9=214271, 99.99=252415] 
2021-12-10 06:20:00:010 40 sec: 47647 operations; 1360.6 current ops/sec; est completion in 44 seconds [INSERT: Count=13606, Max=688127, Min=458, Avg=17642.66, 90=24175, 99=40063, 99.9=211071, 99.99=258175] 
2021-12-10 06:20:10:009 50 sec: 61246 operations; 1359.9 current ops/sec; est completion in 32 seconds [INSERT: Count=13599, Max=558079, Min=455, Avg=17648.51, 90=25535, 99=47167, 99.9=348671, 99.99=555007] 
2021-12-10 06:20:20:009 60 sec: 75393 operations; 1414.7 current ops/sec; est completion in 20 seconds [INSERT: Count=14147, Max=272639, Min=559, Avg=16956.75, 90=24655, 99=60479, 99.9=178047, 99.99=272383] 
2021-12-10 06:20:30:009 70 sec: 88879 operations; 1348.6 current ops/sec; est completion in 9 second [INSERT: Count=13486, Max=367103, Min=433, Avg=17780.45, 90=25039, 99=49023, 99.9=232319, 99.99=305663] 
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:23, serverValue:156}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:21, serverValue:155}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:3, serverValue:136}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:4, serverValue:137}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:7, serverValue:139}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:5, serverValue:154}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2, serverValue:135}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:19, serverValue:151}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:10, serverValue:142}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:24, serverValue:157}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:8, serverValue:140}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:12, serverValue:144}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:18, serverValue:150}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:14, serverValue:146}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:6, serverValue:138}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:17, serverValue:149}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:15, serverValue:147}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:11, serverValue:143}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:13, serverValue:145}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:22, serverValue:153}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:16, serverValue:148}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:9, serverValue:141}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:25, serverValue:158}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:20:38 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:20, serverValue:152}] to localhost:27017 because the pool has been closed.
2021-12-10 06:20:38:162 78 sec: 100000 operations; 1364.04 current ops/sec; [CLEANUP: Count=24, Max=68223, Min=0, Avg=2842.96, 90=3, 99=68223, 99.9=68223, 99.99=68223] [INSERT: Count=11121, Max=575487, Min=465, Avg=16771.85, 90=24351, 99=43711, 99.9=294655, 99.99=566271] 
[OVERALL], RunTime(ms), 78158
[OVERALL], Throughput(ops/sec), 1279.4595562834259
[TOTAL_GCS_Copy], Count, 160
[TOTAL_GC_TIME_Copy], Time(ms), 192
[TOTAL_GC_TIME_%_Copy], Time(%), 0.24565623480641777
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 160
[TOTAL_GC_TIME], Time(ms), 192
[TOTAL_GC_TIME_%], Time(%), 0.24565623480641777
[CLEANUP], Operations, 24
[CLEANUP], AverageLatency(us), 2842.9583333333335
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 68223
[CLEANUP], 95thPercentileLatency(us), 9
[CLEANUP], 99thPercentileLatency(us), 68223
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 18392.14102
[INSERT], MinLatency(us), 433
[INSERT], MaxLatency(us), 688127
[INSERT], 95thPercentileLatency(us), 37727
[INSERT], 99thPercentileLatency(us), 71359
[INSERT], Return=OK, 100000
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /home/azureuser/YCSB/mongodb/conf:/home/azureuser/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/azureuser/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/azureuser/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/home/azureuser/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/azureuser/.m2/repository/org/mongodb/mongo-java-driver/3.11.0/mongo-java-driver-3.11.0.jar:/home/azureuser/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/azureuser/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/azureuser/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureuser/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p mongodb.upsert=true -p operationcount=100000 -threads 24 -t
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p mongodb.upsert=true -p operationcount=100000 -threads 24 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2021-12-10 06:20:55:467 0 sec: 0 operations; est completion in 0 second 
Dec 10, 2021 6:20:55 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[localhost:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1, serverValue:163}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=localhost:27017, type=REPLICA_SET_PRIMARY, state=CONNECTED, ok=true, version=ServerVersion{versionList=[5, 0, 5]}, minWireVersion=0, maxWireVersion=13, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=5538039, setName='rs0', canonicalAddress=10.1.0.5:27017, hosts=[10.1.0.5:27017, 10.1.0.6:27017, 10.1.0.7:27017], passives=[], arbiters=[], primary='10.1.0.5:27017', tagSet=TagSet{[]}, electionId=7fffffff0000000000000006, setVersion=1, lastWriteDate=Fri Dec 10 06:20:38 UTC 2021, lastUpdateTimeNanos=82312084042190}
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:3, serverValue:165}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:18, serverValue:174}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:8, serverValue:167}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:11, serverValue:168}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:10, serverValue:181}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:15, serverValue:177}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:23, serverValue:169}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:20, serverValue:172}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:17, serverValue:175}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:9, serverValue:182}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:14, serverValue:178}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:24, serverValue:166}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:21, serverValue:171}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:13, serverValue:179}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:6, serverValue:184}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:12, serverValue:180}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:7, serverValue:183}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:22, serverValue:170}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:16, serverValue:176}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:19, serverValue:173}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:25, serverValue:164}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:4, serverValue:186}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2, serverValue:187}] to localhost:27017
Dec 10, 2021 6:20:56 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:5, serverValue:185}] to localhost:27017
2021-12-10 06:21:05:365 10 sec: 10890 operations; 1089 current ops/sec; est completion in 1 minute [READ: Count=10912, Max=343295, Min=412, Avg=19949.27, 90=53503, 99=85119, 99.9=334591, 99.99=340223] 
2021-12-10 06:21:15:364 20 sec: 33113 operations; 2222.3 current ops/sec; est completion in 41 seconds [READ: Count=22201, Max=188287, Min=284, Avg=10743.48, 90=20815, 99=60319, 99.9=90495, 99.99=157183] 
2021-12-10 06:21:25:364 30 sec: 58399 operations; 2528.6 current ops/sec; est completion in 22 seconds [READ: Count=25286, Max=217727, Min=340, Avg=9477.08, 90=12791, 99=23135, 99.9=42431, 99.99=75455] 
2021-12-10 06:21:35:364 40 sec: 84806 operations; 2640.7 current ops/sec; est completion in 8 second [READ: Count=26407, Max=169215, Min=578, Avg=9083.34, 90=12639, 99=19711, 99.9=39967, 99.99=86399] 
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:15, serverValue:177}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:6, serverValue:184}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:5, serverValue:185}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:25, serverValue:164}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:7, serverValue:183}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:9, serverValue:182}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:11, serverValue:168}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:8, serverValue:167}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:13, serverValue:179}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:19, serverValue:173}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:18, serverValue:174}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2, serverValue:187}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:21, serverValue:171}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:20, serverValue:172}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:23, serverValue:169}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:3, serverValue:165}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:22, serverValue:170}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:14, serverValue:178}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:12, serverValue:180}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:10, serverValue:181}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:17, serverValue:175}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:4, serverValue:186}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:16, serverValue:176}] to localhost:27017 because the pool has been closed.
Dec 10, 2021 6:21:40 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:24, serverValue:166}] to localhost:27017 because the pool has been closed.
2021-12-10 06:21:40:773 45 sec: 100000 operations; 2809.02 current ops/sec; [READ: Count=15194, Max=132351, Min=273, Avg=8266.26, 90=11271, 99=16639, 99.9=26895, 99.99=77055] [CLEANUP: Count=24, Max=46495, Min=0, Avg=1938.08, 90=1, 99=46495, 99.9=46495, 99.99=46495] 
[OVERALL], RunTime(ms), 45423
[OVERALL], Throughput(ops/sec), 2201.5278603350725
[TOTAL_GCS_Copy], Count, 224
[TOTAL_GC_TIME_Copy], Time(ms), 176
[TOTAL_GC_TIME_%_Copy], Time(%), 0.3874689034189728
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 224
[TOTAL_GC_TIME], Time(ms), 176
[TOTAL_GC_TIME_%], Time(%), 0.3874689034189728
[READ], Operations, 100000
[READ], AverageLatency(us), 10613.00962
[READ], MinLatency(us), 273
[READ], MaxLatency(us), 343295
[READ], 95thPercentileLatency(us), 35743
[READ], 99thPercentileLatency(us), 57951
[READ], Return=OK, 100000
[CLEANUP], Operations, 24
[CLEANUP], AverageLatency(us), 1938.0833333333333
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 46495
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 46495